config/request.xml

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing"><wsa:To>http://localhost:9000/soap/NoService</wsa:To><wsa:MessageID>urn:uuid:e14b229d-1a68-4855-a86d-93c09b72b964</wsa:MessageID><wsa:Action>urn:pushMessage</wsa:Action></soapenv:Header><soapenv:Body><m0:pushMessage xmlns:m0="http://services.samples"><m0:message><m0:deviceToken>0d5ad86b f2f79146 acec09f0 66213b0f b2636ef5 7cbfb3d6 e30b69d8 cd37d944</m0:deviceToken><m0:alert>Test Message</m0:alert><m0:badge>-1</m0:badge><m0:sound xsi:nil="true"/></m0:message></m0:pushMessage></soapenv:Body></soapenv:Envelope>
